{
  "site": {
    "base_path": "/imagine-this-scenario",
    "header_background_image": "header-background-grayscale.png",
    "title": "Imagine _This_ Scenario",
    "subtitle": "_Thoughts on the Future of Opportunity and Equity in Beacon, New York_"
  },
  "authors": {
    "derekenos": {
      "name": "Derek Enos",
      "avatarUrl": "/images/de-avatar.webp",
      "url": "https://derekenos.com"
    }
  },
  "posts": [
    {
      "author": "derekenos",
      "datetime": "2022-12-29",
      "header_background_image": "header-background-grayscale.png",
      "title": "Run It Like a Startup / The Hierarchy of Needs",
      "slug": "2022-12-29-run-it-like-a-startup---the-hierarchy-of-needs",
      "blocks": [
        "For almost a decade, I worked at a small web tech startup called [Octopart](https://octopart.com/). We collected and aggregated inventories from hundreds of electronic and industrial component suppliers and made it all searchable. We were a small team, and we got really good at identifying problems, setting goals, iterating toward solutions, and measuring our progress. Many tech startups share a similar story; a small group of folks leveraging technology to great effect toward some agreed-upon goals. Having had this experience, I'm often shocked at how bad our city government is at these same competencies when it comes to the well-being of our community, despite the fact that the stakes are much higher.",
        "While most startups exist primarily to generate revenue, which Beacon does excel at by increasing its tax base through its support of relentless development, a city government has the much bigger responsibility of ensuring the safety, security, and well-being of its constituents. As a starting point for thinking about what types of things we should expect our city government to provide with respect to community well-being, let's take a look at [Maslow's Hierarchy of Needs](https://en.wikipedia.org/wiki/Maslow's_hierarchy_of_needs), the levels of which (from bottom to top) can be roughly summarized as:",
        "[![Maslow's Hierarchy of Needs](images/MaslowHierarchy.png)](https://en.wikipedia.org/wiki/Maslow's_hierarchy_of_needs)",
        "-decimal[**Physiological** : basic needs like water, food, and shelter | **Safety** : the need for personal, emotional, and financial security | **Belonging and Love** : the need for family, friends, and community | **Esteem** : the need for self-worth and respect from others | **Cognitive** : engaging your creativity, curiosity, and the search meaning | **Aesthetic** : appreciation of beauty in nature, art, and yourself | **Self-actualization** : realizing your full potential | **Transcendence** : focus on things beyond one's self]",
        "While this Hierarchy is not meant to be strictly hierarchical (e.g. you can have some or all of your Belonging and Love needs met without having satisfied all of your Safety needs), it's generally true that each level enables (e.g. financially or psychologically) the levels above it. Many of us in Beacon probably have most of our Physiological needs met, but after that, a lot of us start falling off the pyramid. According to the latest data available from the New York State Education Department, [47% of all students](https://data.nysed.gov/enrollment.php?year=2020&instid=800000053483) enrolled in the Beacon City School District during the 2019 - 2020 school year were considered to be \"Economically Disadvantaged\", which [they define as](https://data.nysed.gov/glossary.php?report=assessment):",
        ">(https://data.nysed.gov/glossary.php?report=assessment) ... those who participate in, or whose family participates in, economic assistance programs, such as the free or reduced-price lunch programs, Social Security Insurance (SSI), Food Stamps, Foster Care, Refugee Assistance (cash or medical assistance), Earned Income Tax Credit (EITC), Home Energy Assistance Program (HEAP), Safety Net Assistance (SNA), Bureau of Indian Affairs (BIA), or Family Assistance: Temporary Assistance for Needy Families (TANF).",
        "High School Principal Corey Dwyer, at the December 12, 2022 Board of Education meeting, [indicated that 49% of Beacon High School students](https://go.boarddocs.com/ny/beacon/Board.nsf/files/CLXT8B718041/$file/BOE%20Presentation%20-%2012.12.22.pdf) meet this criteria. I'd venture to guess that there's more wealth in Beacon now than ever before in its history, yet the families of half of our school children lack basic financial security. While we can't expect our city government to single-handedly elevate us all to a level of Transcendence, it should do everything it can to help ensure that Physiological and Safety needs of every single Beacon citizen",
        "Circling back to my experience at a startup, many companies have adopted a framework for defining measurable goals and tracking their outcomes called [OKRs (Objectives and key results)](https://en.wikipedia.org/wiki/OKR), and I suggest that our city government do the same. From the Wikipedia article:",
        ">(https://en.wikipedia.org/wiki/OKR) OKRs comprise an objective (a significant, concrete, clearly defined goal) and 3–5 key results (measurable success criteria used to track the achievement of that goal).",
        "For example, we could establish an objective like:",
        "-[Improve the safety and security of existing Beacon residents]",
        "define key results like:",
        "-[100% decrease in Economically Disadvantaged households | 100% decrease in households with food insecurity | 100% decrease in residents without health insurance coverage]",
        "Our city government would then plan and execute on things that move us toward this goal, with periodic updates on how we're doing on each of the key results. Note that the inclusion of \"existing\" in the objective statement is very important - otherwise the city could simply intensify gentrification to the point where the economically disadvantaged population is fully displaced. As exemplified by Nick Bostrom's [Paperclip Maximizer](https://en.wikipedia.org/wiki/Instrumental_convergence#Paperclip_maximizer) thought experiment, it's important to consider the potential negative consequences of poorly-defined objectives."
      ]
    }
  ]
}
