{
  "site": {
    "base_path": "/local-maximum",
    "css_path": "/css",
    "images_path": "/images",
    "posts_path": "/",
    "header_background_image": "header-background-grayscale.png",
    "drafts_header_background_image": "00911-3514616341-the word DRAFTS.png",
    "title": "Local Maximum",
    "subtitle": "_Thoughts on the Future of Opportunity and Equity in Beacon, New York_"
  },
  "authors": {
    "derekenos": {
      "name": "Derek Enos",
      "avatar_image": "de-avatar.webp",
      "url": "https://derekenos.com"
    }
  },
  "posts": [
    {
      "draft": true,
      "author": "derekenos",
      "datetime": "2023-01-13",
      "header_background_image": "00924-2143117661-tool wall.png",
      "title": "Beacon Builds",
      "slug": "2023-01-13-beacon-builds",
      "blocks": [
        "A proposal to activate the storefront next to Beacon Reads as an extension of the Howland's Library of Things, while also serving as a Repair Cafe, and community computing resources hub.",
        "[![A Build Builds Storefront Mockup](images/beacon-builds-storefront-mockup.png)](images/beacon-builds-storefront-mockup.png)"
      ]
    },
    {
      "draft": true,
      "author": "derekenos",
      "datetime": "2023-01-02",
      "header_background_image": "00922-1813468116-boats made out of money riding atop waves on the sea.png",
      "title": "Ride the Tide",
      "slug": "2023-01-02-ride-the-tide",
      "blocks": [
        "In some alternate universe, Beacon's Main Street is lined with shops owned and operated by locals, for locals - places for us to buy the regular things that we need and other, more specialized places that reflect our shared interests and hobbies. In this universe, we got novelty shops and luxury services that cater primarily to toursists. This city has a lot going for it, and the New York Times can't stop writing flattering puff pieces about it, so here we are.",
        "I suspect that there's not much we can do about the current state of things on Main Street. The cat's out of the bag. What we can do is figure out a way to leverage the current state of things to the direct financial benefit of our community, namely by locally producing more of the goods that are sold by these shops.",
        "I propose that, as part of a larger local manufacturing effort, we start making products specifically targeted at the clientele of the shops that we have.",
        "-[soap | oat milk | baked goods | dummy light statues | granola | kombucha]"
      ]
    },
    {
      "draft": true,
      "author": "derekenos",
      "datetime": "2022-12-30",
      "header_background_image": "00901-3730104822-computer cloud internet.png",
      "title": "The Rationale for Local Computing",
      "slug": "2022-12-30-the-rationale-for-local-computing",
      "blocks": [
        "When I tell people that I'm running [beaconny.net](https://beaconny.net) from computers in my basement, they usually ask \"why?\" - I'll tell you why!",
        "<div style=\"clear: left;\"></div>",
        "## All the Fancy Services",
        "You know em, you love em, you can not live without them:",
        "<img src=\"images/social-media-logos.png\" alt=\"logos of the most popular online social networks\" style=\"max-width: 100%; float: left; margin-right: 1rem;\">",
        "But we're all just users of these services, with no control over, or visibility into, their operation, or any guarantees that they'll continue to work in the future. At any moment, any of these services could disappear and take all of its content and our social network with it.",
        "From a software engineering perspective, there's nothing special about these platforms - an experienced developer could whip up a passable clone of any of these in a week's time. The real value is in the fact that people have agreed to use them, and as the ol' adage goes: <q cite=\"https://quoteinvestigator.com/2017/07/16/product/\">If you are not paying for it, you’re not the customer; you’re the product being sold.</q>",
        "While I'm not suggesting that we all abandon the Internet at large and vow to use only hand-crafted, artisanal, local digital services, for the reasons detailed below, we should do what we can to ensure that our community can continue to leverage the tools of technology, regardless of what the future may hold.",

        "## Dependability",
        "![The Rapberry Pi that runs knowledge.beaconny.net](images/knowledge-beaconny-net-server.jpg)",
        "For most, the Internet is a thing that runs out there, in _The Cloud_ &#8482;, on computers that they've never seen. But the dirty truth is that _The Cloud_ &#8482 is just someone elses' computers, and anyone can make their computer part of the Internet. For example, check out this photo of the [Raspberry Pi](https://en.wikipedia.org/wiki/Raspberry_Pi) that runs the [Kiwix](https://www.kiwix.org/en/) server at [knowledge.beaconny.net](http://knowledge.beaconny.net). Every time someone goes to that website, lights starting blinking in my basement - it's very exciting! Even if the Internet somehow disappeared, you could still walk over to my front yard, connect to my wifi access point, and read [these 50,000+ ebooks](https://knowledge.beaconny.net/gutenberg_en_all_2022-10/A/Home.html), or check out [this wikipedia article on sloths](https://knowledge.beaconny.net/wikipedia_en_all_maxi_2022-05/A/Sloth).",

        "## Ownership",
        "We should all have local backups of our important documents, photos, and videos. Check out this NYT article: [Your Memories. Their Cloud.](https://archive.is/M3UPK)",

        "## Revenge of the Nerds",
        "## Conservation",
        "## While We Still Can"
      ]
    },
    {
      "draft": true,
      "author": "derekenos",
      "datetime": "1999-09-09",
      "header_background_image": "",
      "title": "~ stubs ~",
      "slug": "1999-09-09---stubs--",
      "blocks": [
        "## Build Lifeboats",
        "[https://youtu.be/LQTuDttP2Yg?t=4555](https://youtu.be/LQTuDttP2Yg?t=4555)",
        "## Beacon Owner's Manual",
        "### Dear ___,",
        "#### Congratulations on your purchase of _____, and welcome to our community!",
        "This manual will provide you with information...",
        "### Sincerely,",
        "-[Derek Enos | ...]"
      ]
    },
    {
      "draft": false,
      "author": "derekenos",
      "datetime": "2022-12-29",
      "header_background_image": "00881-60802327-maslow's hierarchy of needs pyramid.png",
      "title": "Run It Like a Startup / The Hierarchy of Needs",
      "slug": "2022-12-29-run-it-like-a-startup---the-hierarchy-of-needs",
      "blocks": [
        "For almost a decade, I worked at a small web tech startup called [Octopart](https://octopart.com/). We were a small team, and we got really good at identifying problems, setting goals, iterating toward solutions, and measuring our progress. Many tech startups share a similar story; a small group of folks leveraging technology to great effect toward some agreed-upon goals. Having had this experience, I'm often shocked at how bad our city government is at these same competencies, specifically when it comes to addressing the fundamental needs of our community.",

        "While most startups exist primarily to generate revenue, which Beacon does excel at by increasing its tax base through its support of relentless development, a city government has a much more important responsibility. As a starting point for thinking about what types of things we should expect from our city government, let's take a look at [Maslow's Hierarchy of Needs](https://en.wikipedia.org/wiki/Maslow's_hierarchy_of_needs):",

        "[![Maslow's Hierarchy of Needs](images/MaslowHierarchy.png)](https://en.wikipedia.org/wiki/Maslow's_hierarchy_of_needs)",

        "The levels (best read from bottom to top) can be summarized as:",

        "-[**Physiological** : basic needs like water, food, and shelter | **Safety** : the need for personal, emotional, and financial security | **Belonging and Love** : the need for family, friends, and community | **Esteem** : the need for self-worth and respect from others | **Cognitive** : the need to engage your creativity, curiosity, and the search meaning | **Aesthetic** : the need for beauty in nature, art, and yourself | **Self-actualization** : the need to realize your full potential | **Transcendence** : the need to focus on things beyond yourself]",

        "While this Hierarchy is not meant to be strictly hierarchical, e.g. you can have some or all of your Belonging and Love needs met without having satisfied all of your Safety needs, it's generally true that each level enables, e.g. financially or psychologically, the levels above it. Many of us in Beacon probably have most of our Physiological needs met, but after that, a lot of us start falling off the pyramid. According to the latest data available from the New York State Education Department, [47% of all students](https://data.nysed.gov/enrollment.php?year=2020&instid=800000053483) enrolled in the Beacon City School District during the 2019 - 2020 school year were considered to be \"Economically Disadvantaged\", which [they define as](https://data.nysed.gov/glossary.php?report=assessment):",

        ">(https://data.nysed.gov/glossary.php?report=assessment) ... those who participate in, or whose family participates in, economic assistance programs, such as the free or reduced-price lunch programs, Social Security Insurance (SSI), Food Stamps, Foster Care, Refugee Assistance (cash or medical assistance), Earned Income Tax Credit (EITC), Home Energy Assistance Program (HEAP), Safety Net Assistance (SNA), Bureau of Indian Affairs (BIA), or Family Assistance: Temporary Assistance for Needy Families (TANF).",

        "High School Principal Corey Dwyer, at the December 12, 2022 Board of Education meeting, [indicated that 49% of Beacon High School students](https://go.boarddocs.com/ny/beacon/Board.nsf/files/CLXT8B718041/$file/BOE%20Presentation%20-%2012.12.22.pdf) meet this criteria. I'd venture to guess that there's more wealth in Beacon now than ever before in its history, yet the families of half of our school children lack basic financial security. While we can't expect our city government to be all things to all people, it should do everything in its power to help ensure that the basic Physiological and Safety needs of every Beacon resident are met.",

        "Circling back to my experience at a startup, many companies have adopted a framework for defining measurable goals and tracking their outcomes called [OKRs (Objectives and key results)](https://en.wikipedia.org/wiki/OKR), and I suggest that our city government should do the same. From the Wikipedia article:",
        ">(https://en.wikipedia.org/wiki/OKR) OKRs comprise an objective (a significant, concrete, clearly defined goal) and 3–5 key results (measurable success criteria used to track the achievement of that goal).",

        "For example, we could establish an objective like:",

        "-[Improve the safety and security of existing Beacon residents]",

        "and define key results like:",

        "-[100% decrease in Economically Disadvantaged households | 100% decrease in households with food insecurity | 100% decrease in residents without health insurance]",

        "Our city government would then plan and execute on things that move us toward this goal, with periodic updates on how we're doing on each of the key results. Note that the inclusion of \"existing\" in the objective statement is very important - otherwise the city could simply intensify gentrification to the point where the economically disadvantaged population is fully displaced. As exemplified by Nick Bostrom's [Paperclip Maximizer](https://en.wikipedia.org/wiki/Instrumental_convergence#Paperclip_maximizer) thought experiment, it's important to consider the potential negative consequences of poorly-defined objectives.",

        "Though all of us deserve the opportunity to pursue our fullest potential, it's difficult to do this when you're suffering from financial, housing, or food insecurity. To the extent that is possible and appropriate, we should expect our city government to do everything in its power to help ensure the safety and security of our community members.",
        "## Addendum - 2023-01-17",
        "A similar, more popular representation of the idea behind Maslow's Hierarchy is the [Declaration of Independence's](https://en.wikipedia.org/wiki/Life,_Liberty_and_the_pursuit_of_Happiness): \"Life, Liberty, and the pursuit of Happiness\".",
        "![How \"Life, Liberty, and the pursuit of Happiness\" sort of aligns with Maslow's Hierarchy](images/MaslowHierarchy-annotated-llatpoh.png)"
      ]
    }
  ]
}
